In [21]:
import pandas as pd
import numpy as np

In [22]:
#np.random.randn->normal dağılımdan gelen rastgele dizi veya matrixi verebiliyordu
data=np.random.randn(4,3)

In [23]:
data

array([[-1.76375085,  0.12287431, -0.23325714],
       [ 0.23889138,  0.44970927,  0.39514934],
       [ 0.18642213,  1.40744937, -0.48136714],
       [ 0.29173158,  0.67963955,  1.98878179]])

In [24]:
dataFrame=pd.DataFrame(data)

In [25]:
dataFrame #verilerin iki boyutlu hali

          0         1         2
0 -1.763751  0.122874 -0.233257
1  0.238891  0.449709  0.395149
2  0.186422  1.407449 -0.481367
3  0.291732  0.679640  1.988782

In [26]:
dataFrame[0] #kolonu karşımıza getiriyor

0   -1.763751
1    0.238891
2    0.186422
3    0.291732
Name: 0, dtype: float64

In [27]:
type(dataFrame[0])

pandas.core.series.Series

In [28]:
 yeniDataFrame=pd.DataFrame(data,index=["Atıl","Büşra","Selin","Sevgi"])

In [29]:
yeniDataFrame

              0         1         2
Atıl  -1.763751  0.122874 -0.233257
Büşra  0.238891  0.449709  0.395149
Selin  0.186422  1.407449 -0.481367
Sevgi  0.291732  0.679640  1.988782

In [30]:
 yeniDataFrame=pd.DataFrame(data,index=["Atıl","Büşra","Selin","Sevgi"],columns=["Maas","Yas","Calisma Saati"])

In [31]:
yeniDataFrame

           Maas       Yas  Calisma Saati
Atıl  -1.763751  0.122874      -0.233257
Büşra  0.238891  0.449709       0.395149
Selin  0.186422  1.407449      -0.481367
Sevgi  0.291732  0.679640       1.988782

In [32]:
yeniDataFrame["Yas"]

Atıl     0.122874
Büşra    0.449709
Selin    1.407449
Sevgi    0.679640
Name: Yas, dtype: float64

In [33]:
yeniDataFrame["Calisma Saati"]

Atıl    -0.233257
Büşra    0.395149
Selin   -0.481367
Sevgi    1.988782
Name: Calisma Saati, dtype: float64

In [34]:
yeniDataFrame[["Maas","Yas"]]

           Maas       Yas
Atıl  -1.763751  0.122874
Büşra  0.238891  0.449709
Selin  0.186422  1.407449
Sevgi  0.291732  0.679640

In [35]:
#sadece Atıl'ı getirmesini istiyorum
yeniDataFrame.loc["Atıl"]

Maas            -1.763751
Yas              0.122874
Calisma Saati   -0.233257
Name: Atıl, dtype: float64

In [36]:
yeniDataFrame.loc["Sevgi"]

Maas             0.291732
Yas              0.679640
Calisma Saati    1.988782
Name: Sevgi, dtype: float64

In [37]:
#iloc ->index location
yeniDataFrame.iloc[1]

Maas             0.238891
Yas              0.449709
Calisma Saati    0.395149
Name: Büşra, dtype: float64

# data-frame indexler

In [39]:
yeniDataFrame

           Maas       Yas  Calisma Saati
Atıl  -1.763751  0.122874      -0.233257
Büşra  0.238891  0.449709       0.395149
Selin  0.186422  1.407449      -0.481367
Sevgi  0.291732  0.679640       1.988782

In [40]:
#bir tane daha kolon eklemek istiyoruz
yeniDataFrame["Emeklilik Yasi"]=yeniDataFrame["Yas"]+yeniDataFrame["Yas"]

In [41]:
yeniDataFrame

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Atıl  -1.763751  0.122874      -0.233257        0.245749
Büşra  0.238891  0.449709       0.395149        0.899419
Selin  0.186422  1.407449      -0.481367        2.814899
Sevgi  0.291732  0.679640       1.988782        1.359279

In [42]:
#drop: düşürmek
yeniDataFrame.drop("Emeklilik Yasi" , axis=1) #axis=1 column düşürme

           Maas       Yas  Calisma Saati
Atıl  -1.763751  0.122874      -0.233257
Büşra  0.238891  0.449709       0.395149
Selin  0.186422  1.407449      -0.481367
Sevgi  0.291732  0.679640       1.988782

In [44]:
#yeniDataFrame.drop("Atıl" , axis=0) #axis=0 row düşürme ya da 
yeniDataFrame.drop("Atıl")

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Büşra  0.238891  0.449709       0.395149        0.899419
Selin  0.186422  1.407449      -0.481367        2.814899
Sevgi  0.291732  0.679640       1.988782        1.359279

In [45]:
yeniDataFrame #sanki hiçbiri düşmemiş gibi tekrar aynı şeyi veriyor

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Atıl  -1.763751  0.122874      -0.233257        0.245749
Büşra  0.238891  0.449709       0.395149        0.899419
Selin  0.186422  1.407449      -0.481367        2.814899
Sevgi  0.291732  0.679640       1.988782        1.359279

In [46]:
#komple silmek için o şeyi belirtmek lazım. inplace: bunun yerinde işlemi yap
yeniDataFrame.drop("Emeklilik Yasi",axis=1,inplace=True)

In [47]:
yeniDataFrame

           Maas       Yas  Calisma Saati
Atıl  -1.763751  0.122874      -0.233257
Büşra  0.238891  0.449709       0.395149
Selin  0.186422  1.407449      -0.481367
Sevgi  0.291732  0.679640       1.988782

In [49]:
yeniDataFrame.loc["Atıl"]["Maas"]

-1.7637508515777853

In [51]:
yeniDataFrame.loc["Selin","Yas"]

1.4074493654355082

In [52]:
yeniDataFrame

           Maas       Yas  Calisma Saati
Atıl  -1.763751  0.122874      -0.233257
Büşra  0.238891  0.449709       0.395149
Selin  0.186422  1.407449      -0.481367
Sevgi  0.291732  0.679640       1.988782

In [53]:
yeniDataFrame<0

        Maas    Yas  Calisma Saati
Atıl    True  False           True
Büşra  False  False          False
Selin  False  False           True
Sevgi  False  False          False

In [54]:
booleanFrame=yeniDataFrame<0

In [55]:
booleanFrame

        Maas    Yas  Calisma Saati
Atıl    True  False           True
Büşra  False  False          False
Selin  False  False           True
Sevgi  False  False          False

In [56]:
yeniDataFrame

           Maas       Yas  Calisma Saati
Atıl  -1.763751  0.122874      -0.233257
Büşra  0.238891  0.449709       0.395149
Selin  0.186422  1.407449      -0.481367
Sevgi  0.291732  0.679640       1.988782

In [57]:
yeniDataFrame[booleanFrame] #0 dan küçük değerleri gösterir diğerleri NaN olur

           Maas  Yas  Calisma Saati
Atıl  -1.763751  NaN      -0.233257
Büşra       NaN  NaN            NaN
Selin       NaN  NaN      -0.481367
Sevgi       NaN  NaN            NaN

In [58]:
yeniDataFrame["Yas"]>0

Atıl     True
Büşra    True
Selin    True
Sevgi    True
Name: Yas, dtype: bool

In [60]:
yeniDataFrame[yeniDataFrame["Maas"]>0]

           Maas       Yas  Calisma Saati
Büşra  0.238891  0.449709       0.395149
Selin  0.186422  1.407449      -0.481367
Sevgi  0.291732  0.679640       1.988782

# index değiştirme

In [61]:
yeniDataFrame.reset_index ()  #indexleri resetliyor

   index      Maas       Yas  Calisma Saati
0   Atıl -1.763751  0.122874      -0.233257
1  Büşra  0.238891  0.449709       0.395149
2  Selin  0.186422  1.407449      -0.481367
3  Sevgi  0.291732  0.679640       1.988782

In [62]:
 yeniDataFrame #yine eskisi geliyor o yüzden inplace kullanacağız

           Maas       Yas  Calisma Saati
Atıl  -1.763751  0.122874      -0.233257
Büşra  0.238891  0.449709       0.395149
Selin  0.186422  1.407449      -0.481367
Sevgi  0.291732  0.679640       1.988782

In [63]:
yeniIndexListesi=["Ati","Büş","Sel","Sev"]

In [64]:
yeniDataFrame["Yeni Index"]=yeniIndexListesi

In [65]:
yeniDataFrame

           Maas       Yas  Calisma Saati Yeni Index
Atıl  -1.763751  0.122874      -0.233257        Ati
Büşra  0.238891  0.449709       0.395149        Büş
Selin  0.186422  1.407449      -0.481367        Sel
Sevgi  0.291732  0.679640       1.988782        Sev

In [68]:
yeniDataFrame.set_index("Yeni Index",inplace=True)  #set_index: indexi ayarlama

In [69]:
yeniDataFrame

                Maas       Yas  Calisma Saati
Yeni Index
Ati        -1.763751  0.122874      -0.233257
Büş         0.238891  0.449709       0.395149
Sel         0.186422  1.407449      -0.481367
Sev         0.291732  0.679640       1.988782

In [70]:
yeniDataFrame.loc["Büş"]

Maas             0.238891
Yas              0.449709
Calisma Saati    0.395149
Name: Büş, dtype: float64

# Multi Index

In [72]:
#Index sayısının çok olduğu durumlarda kullanılır ve temel olarak gruplanır.
ilkIndexler=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [73]:
icIndexler=["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [74]:
birlesmisIndex=list(zip(ilkIndexler,icIndexler))

In [75]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [76]:
birlesmisIndex=pd.MultiIndex.from_tuples(birlesmisIndex)

In [77]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [78]:
type(birlesmisIndex)

pandas.core.indexes.multi.MultiIndex

In [79]:
benimCizgiFilmListem=[[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [80]:
cizgiFilmNumpyDizisi=np.array(benimCizgiFilmListem)

In [81]:
cizgiFilmDataFrame=pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndex,columns=["Yas","Meslek"])

In [82]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [83]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [84]:
cizgiFilmDataFrame.loc["South Park"]

        Yas Meslek
Cartman   9      D
Kenny    10      E
Kyle     11      F

In [85]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [86]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [87]:
cizgiFilmDataFrame.index.names=["Film Adı","İsim"]

In [88]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F